[
  {
    "title": "Raising Girls With ADHD",
    "authors": [
      "James W. Forgan",
      "Mary Anne Richey"
    ],
    "publisher": "Routledge",
    "publishedDate": "2021-09-09",
    "description": "Although an increasing number of girls are diagnosed with ADHD every year, most of the focus of parent and teacher interventions has been on boys, leaving girls with ADHD frustrated and prone to acting out. Written by two professionals who have “been there and done that” with their own children with ADHD, Raising Girls With ADHD provides expert information to empower parents to make decisions about identification, treatment options, behavioral strategies, personal/social adjustment, educational impact, and many other issues from preschool through high school. These girls' struggles with socialization and peer acceptance, executive functioning skills like memory and organization, and emotional well-being and self-confidence are discussed with a goal of maximizing strengths and providing supports for weaknesses. Complete self-reflection surveys and action steps for parents and girls alike are included to create a dynamic action plan for your daughter's success in school and beyond.",
    "image": "http://books.google.com/books/content?id=vyhBEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "averageRating": 4,
    "ratingsCount": 4,
    "categories": [
      "Education"
    ],
    "pageCount": 296,
    "isbn10": "1000495582",
    "isbn13": "9781000495584",
    "googleBooks": {
      "id": "vyhBEAAAQBAJ",
      "preview": "http://books.google.com/books?id=vyhBEAAAQBAJ&pg=PT105&dq=intitle:Raising+Girls:+How+to+Help+Your+Daughter+Grow+Up+Happy,+Healthy,+and+Strong&hl=&cd=10&source=gbs_api",
      "info": "https://play.google.com/store/books/details?id=vyhBEAAAQBAJ&source=gbs_api",
      "canonical": "https://play.google.com/store/books/details?id=vyhBEAAAQBAJ"
    },
    "issueNumber": 12,
    "progressPercent": 0,
    "state": "reading",
    "startedAt": "2023-02-14T10:24:20.000Z"
  },
  {
    "title": "Radical Candor",
    "authors": [
      "Kim Scott"
    ],
    "publishedDate": "2017-03-14",
    "description": "\"I raced through RADICAL CANDOR--It’s thrilling to learn a framework that shows how to be both a better boss and a better colleague. RADICAL CANDOR is packed with illuminating truths, insightful advice, and practical suggestions, all illustrated with engaging (and often funny) stories from Kim Scott’s own experiences at places like Apple, Google, and various start-ups. Indispensable.\"--Gretchen Rubin author of NYT bestseller THE HAPPINESS PROJECT \"Reading Radical Candor will help you build, lead, and inspire teams to do the best work of their lives. Kim Scott's insights--based on her experience, keen observational intelligence and analysis--will help you be a better leader and create a more effective organization.\"--Sheryl Sandberg author of the NYT bestseller LEAN IN \"Kim Scott has a well-earned reputation as a kick-ass boss and a voice that CEOs take seriously. In this remarkable book, she draws on her extensive experience to provide clear and honest guidance on the fundamentals of leading others: how to give (and receive) feedback, how to make smart decisions, how to keep moving forward, and much more. If you manage people?whether it be 1 person or a 1,000--you need RADICAL CANDOR. Now.\"--Daniel Pink author of NYT bestseller DRIVE From the time we learn to speak, we’re told that if you don’t have anything nice to say, don’t say anything at all. When you become a manager, it’s your job to say it--and your obligation. Author Kim Scott was an executive at Google and then at Apple, where she developed a class on how to be a good boss. She has earned growing fame in recent years with her vital new approach to effective management, Radical Candor. Radical Candor is a simple idea: to be a good boss, you have to Care Personally at the same time that you Challenge Directly. When you challenge without caring it’s obnoxious aggression; when you care without challenging it’s ruinous empathy. When you do neither it’s manipulative insincerity. This simple framework can help you build better relationships at work, and fulfill your three key responsibilities as a leader: creating a culture of feedback (praise and criticism), building a cohesive team, and achieving results you’re all proud of. Radical Candor offers a guide to those bewildered or exhausted by management, written for bosses and those who manage bosses. Taken from years of the author’s experience, and distilled clearly giving actionable lessons to the reader; it shows managers how to be successful while retaining their humanity, finding meaning in their job, and creating an environment where people both love their work and their colleagues.",
    "image": "http://books.google.com/books/content?id=Q8INDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "averageRating": 4,
    "ratingsCount": 4,
    "categories": [
      "Business & Economics"
    ],
    "pageCount": 272,
    "isbn10": "1250103509",
    "isbn13": "9781250103505",
    "googleBooks": {
      "id": "Q8INDgAAQBAJ",
      "preview": "http://books.google.com/books?id=Q8INDgAAQBAJ&printsec=frontcover&dq=intitle:Radical+Candor:+Be+a+Kick-Ass+Boss+Without+Losing+Your+Humanity+by+Kim+Scott&hl=&cd=1&source=gbs_api",
      "info": "http://books.google.com/books?id=Q8INDgAAQBAJ&dq=intitle:Radical+Candor:+Be+a+Kick-Ass+Boss+Without+Losing+Your+Humanity+by+Kim+Scott&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/Radical_Candor.html?hl=&id=Q8INDgAAQBAJ"
    },
    "issueNumber": 11,
    "progressPercent": 0,
    "state": "completed",
    "startedAt": "2022-06-21T00:10:42.000Z",
    "completedAt": "2023-02-14T10:23:07.000Z",
    "timeToComplete": 20599945000,
    "timeToCompleteFormatted": "7 months"
  },
  {
    "title": "An Elegant Puzzle",
    "authors": [
      "Will Larson"
    ],
    "publishedDate": "2019-05-28",
    "description": "There's a saying that people don't leave companies, they leave managers. Management is a key part of any organization, yet the discipline is often self-taught and unstructured. Getting to the good solutions of complex management challenges can make the difference between fulfillment and frustration for teams, and, ultimately, the success or failure of companies.Will Larson's An Elegant Puzzle orients around the particular challenges of engineering management--from sizing teams to technical debt to succession planning--and provides a path to the good solutions. Drawing from his experience at Digg, Uber, and Stripe, Will Larson has developed a thoughtful approach to engineering management that leaders of all levels at companies of all sizes can apply. An Elegant Puzzle balances structured principles and human-centric thinking to help any leader create more effective and rewarding organizations for engineers to thrive in.",
    "image": "https://tse2.mm.bing.net/th?q=An%20Elegant%20Puzzle%20by%20function%20join()%20%7B%20%5Bnative%20code%5D%20%7D&w=256&c=7&rs=1&p=0&dpr=3&pid=1.7&mkt=en-IN&adlt=moderate",
    "language": "en",
    "isbn10": "1732265186",
    "isbn13": "9781732265189",
    "googleBooks": {
      "id": "2ZQrxQEACAAJ",
      "preview": "http://books.google.com/books?id=2ZQrxQEACAAJ&dq=intitle:An+elegant+puzzle+by+will+larson&hl=&cd=1&source=gbs_api",
      "info": "http://books.google.com/books?id=2ZQrxQEACAAJ&dq=intitle:An+elegant+puzzle+by+will+larson&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/An_Elegant_Puzzle.html?hl=&id=2ZQrxQEACAAJ"
    },
    "issueNumber": 10,
    "progressPercent": 0,
    "state": "completed",
    "startedAt": "2022-05-09T11:14:54.000Z",
    "completedAt": "2022-05-09T11:17:50.000Z",
    "timeToComplete": 176000,
    "timeToCompleteFormatted": "2 minutes"
  },
  {
    "title": "The One Minute Manager",
    "authors": [
      "Kenneth H. Blanchard",
      "Spencer Johnson"
    ],
    "publisher": "Berkley Trade",
    "publishedDate": "1983",
    "description": "Details a simple, yet effective management system based on three fundamental strategies for earning raises, promotions, and power in business",
    "image": "http://books.google.com/books/content?id=sxA9KMIJGZgC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "language": "en",
    "averageRating": 3,
    "ratingsCount": 19,
    "categories": [
      "Business & Economics"
    ],
    "pageCount": 111,
    "isbn10": "0425098478",
    "isbn13": "9780425098479",
    "googleBooks": {
      "id": "sxA9KMIJGZgC",
      "preview": "http://books.google.com/books?id=sxA9KMIJGZgC&q=intitle:the+one+minute+manager+by+ken+blanchard+and+spencer+johnson&dq=intitle:the+one+minute+manager+by+ken+blanchard+and+spencer+johnson&hl=&cd=3&source=gbs_api",
      "info": "http://books.google.com/books?id=sxA9KMIJGZgC&dq=intitle:the+one+minute+manager+by+ken+blanchard+and+spencer+johnson&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/The_One_Minute_Manager.html?hl=&id=sxA9KMIJGZgC"
    },
    "issueNumber": 9,
    "progressPercent": 0,
    "state": "completed",
    "startedAt": "2022-05-09T11:13:21.000Z",
    "completedAt": "2022-05-09T11:14:10.000Z",
    "timeToComplete": 49000,
    "timeToCompleteFormatted": "49 seconds"
  },
  {
    "title": "The First 90 Days, Updated and Expanded",
    "authors": [
      "Michael D. Watkins"
    ],
    "publisher": "Harvard Business Review Press",
    "publishedDate": "2013-04-23",
    "description": "The world’s most trusted guide for leaders in transition Transitions are a critical time for leaders. In fact, most agree that moving into a new role is the biggest challenge a manager will face. While transitions offer a chance to start fresh and make needed changes in an organization, they also place leaders in a position of acute vulnerability. Missteps made during the crucial first three months in a new role can jeopardize or even derail your success. In this updated and expanded version of the international bestseller The First 90 Days, Michael D. Watkins offers proven strategies for conquering the challenges of transitions—no matter where you are in your career. Watkins, a noted expert on leadership transitions and adviser to senior leaders in all types of organizations, also addresses today’s increasingly demanding professional landscape, where managers face not only more frequent transitions but also steeper expectations once they step into their new jobs. By walking you through every aspect of the transition scenario, Watkins identifies the most common pitfalls new leaders encounter and provides the tools and strategies you need to avoid them. You’ll learn how to secure critical early wins, an important first step in establishing yourself in your new role. Each chapter also includes checklists, practical tools, and self-assessments to help you assimilate key lessons and apply them to your own situation. Whether you’re starting a new job, being promoted from within, embarking on an overseas assignment, or being tapped as CEO, how you manage your transition will determine whether you succeed or fail. Use this book as your trusted guide.",
    "image": "http://books.google.com/books/content?id=QGkHs4pExOQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "averageRating": 3.5,
    "ratingsCount": 9,
    "categories": [
      "Business & Economics"
    ],
    "pageCount": 304,
    "isbn10": "1422191397",
    "isbn13": "9781422191392",
    "googleBooks": {
      "id": "QGkHs4pExOQC",
      "preview": "http://books.google.com/books?id=QGkHs4pExOQC&printsec=frontcover&dq=intitle:The+first+90+days+by+michael+d+watkins&hl=&cd=1&source=gbs_api",
      "info": "https://play.google.com/store/books/details?id=QGkHs4pExOQC&source=gbs_api",
      "canonical": "https://play.google.com/store/books/details?id=QGkHs4pExOQC"
    },
    "issueNumber": 8,
    "progressPercent": 0,
    "state": "completed",
    "startedAt": "2022-05-09T11:12:57.000Z",
    "completedAt": "2022-05-09T11:13:37.000Z",
    "timeToComplete": 40000,
    "timeToCompleteFormatted": "40 seconds"
  },
  {
    "title": "Atomic Habits",
    "authors": [
      "James Clear"
    ],
    "publisher": "Penguin",
    "publishedDate": "2018-10-16",
    "description": "The #1 New York Times bestseller. Over 4 million copies sold! Tiny Changes, Remarkable Results No matter your goals, Atomic Habits offers a proven framework for improving--every day. James Clear, one of the world's leading experts on habit formation, reveals practical strategies that will teach you exactly how to form good habits, break bad ones, and master the tiny behaviors that lead to remarkable results. If you're having trouble changing your habits, the problem isn't you. The problem is your system. Bad habits repeat themselves again and again not because you don't want to change, but because you have the wrong system for change. You do not rise to the level of your goals. You fall to the level of your systems. Here, you'll get a proven system that can take you to new heights. Clear is known for his ability to distill complex topics into simple behaviors that can be easily applied to daily life and work. Here, he draws on the most proven ideas from biology, psychology, and neuroscience to create an easy-to-understand guide for making good habits inevitable and bad habits impossible. Along the way, readers will be inspired and entertained with true stories from Olympic gold medalists, award-winning artists, business leaders, life-saving physicians, and star comedians who have used the science of small habits to master their craft and vault to the top of their field. Learn how to: • make time for new habits (even when life gets crazy); • overcome a lack of motivation and willpower; • design your environment to make success easier; • get back on track when you fall off course; ...and much more. Atomic Habits will reshape the way you think about progress and success, and give you the tools and strategies you need to transform your habits--whether you are a team looking to win a championship, an organization hoping to redefine an industry, or simply an individual who wishes to quit smoking, lose weight, reduce stress, or achieve any other goal.",
    "image": "http://books.google.com/books/content?id=XfFvDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "averageRating": 4,
    "ratingsCount": 28,
    "categories": [
      "Business & Economics"
    ],
    "pageCount": 320,
    "isbn10": "0735211299",
    "isbn13": "9780735211292",
    "googleBooks": {
      "id": "XfFvDwAAQBAJ",
      "preview": "http://books.google.com/books?id=XfFvDwAAQBAJ&printsec=frontcover&dq=intitle:atomic+habits+by+james+clear&hl=&cd=1&source=gbs_api",
      "info": "http://books.google.com/books?id=XfFvDwAAQBAJ&dq=intitle:atomic+habits+by+james+clear&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/Atomic_Habits.html?hl=&id=XfFvDwAAQBAJ"
    },
    "issueNumber": 7,
    "progressPercent": 0,
    "state": "completed",
    "startedAt": "2022-05-09T11:11:45.000Z",
    "completedAt": "2022-05-09T11:13:48.000Z",
    "timeToComplete": 123000,
    "timeToCompleteFormatted": "2 minutes"
  },
  {
    "title": "Monolith to Microservices",
    "authors": [
      "Sam Newman"
    ],
    "publisher": "O'Reilly Media",
    "publishedDate": "2019-11-14",
    "description": "How do you detangle a monolithic system and migrate it to a microservice architecture? How do you do it while maintaining business-as-usual? As a companion to Sam Newman’s extremely popular Building Microservices, this new book details a proven method for transitioning an existing monolithic system to a microservice architecture. With many illustrative examples, insightful migration patterns, and a bevy of practical advice to transition your monolith enterprise into a microservice operation, this practical guide covers multiple scenarios and strategies for a successful migration, from initial planning all the way through application and database decomposition. You’ll learn several tried and tested patterns and techniques that you can use as you migrate your existing architecture. Ideal for organizations looking to transition to microservices, rather than rebuild Helps companies determine whether to migrate, when to migrate, and where to begin Addresses communication, integration, and the migration of legacy systems Discusses multiple migration patterns and where they apply Provides database migration examples, along with synchronization strategies Explores application decomposition, including several architectural refactoring patterns Delves into details of database decomposition, including the impact of breaking referential and transactional integrity, new failure modes, and more",
    "image": "http://books.google.com/books/content?id=nNa_DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "averageRating": 1,
    "ratingsCount": 1,
    "categories": [
      "Computers"
    ],
    "pageCount": 272,
    "isbn10": "1492047813",
    "isbn13": "9781492047810",
    "googleBooks": {
      "id": "nNa_DwAAQBAJ",
      "preview": "http://books.google.com/books?id=nNa_DwAAQBAJ&printsec=frontcover&dq=intitle:monolith+to+microservices+by+sam+newman&hl=&cd=2&source=gbs_api",
      "info": "http://books.google.com/books?id=nNa_DwAAQBAJ&dq=intitle:monolith+to+microservices+by+sam+newman&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/Monolith_to_Microservices.html?hl=&id=nNa_DwAAQBAJ"
    },
    "issueNumber": 6,
    "progressPercent": 0,
    "state": "completed",
    "startedAt": "2022-05-09T11:11:33.000Z",
    "completedAt": "2022-05-09T11:14:01.000Z",
    "timeToComplete": 148000,
    "timeToCompleteFormatted": "2 minutes"
  },
  {
    "title": "The Subtle Art of Not Giving a F*ck",
    "authors": [
      "Mark Manson"
    ],
    "publisher": "HarperCollins",
    "publishedDate": "2016-09-13",
    "description": "#1 New York Times Bestseller Over 10 million copies sold In this generation-defining self-help guide, a superstar blogger cuts through the crap to show us how to stop trying to be \"positive\" all the time so that we can truly become better, happier people. For decades, we’ve been told that positive thinking is the key to a happy, rich life. \"F**k positivity,\" Mark Manson says. \"Let’s be honest, shit is f**ked and we have to live with it.\" In his wildly popular Internet blog, Manson doesn’t sugarcoat or equivocate. He tells it like it is—a dose of raw, refreshing, honest truth that is sorely lacking today. The Subtle Art of Not Giving a F**k is his antidote to the coddling, let’s-all-feel-good mindset that has infected American society and spoiled a generation, rewarding them with gold medals just for showing up. Manson makes the argument, backed both by academic research and well-timed poop jokes, that improving our lives hinges not on our ability to turn lemons into lemonade, but on learning to stomach lemons better. Human beings are flawed and limited—\"not everybody can be extraordinary, there are winners and losers in society, and some of it is not fair or your fault.\" Manson advises us to get to know our limitations and accept them. Once we embrace our fears, faults, and uncertainties, once we stop running and avoiding and start confronting painful truths, we can begin to find the courage, perseverance, honesty, responsibility, curiosity, and forgiveness we seek. There are only so many things we can give a f**k about so we need to figure out which ones really matter, Manson makes clear. While money is nice, caring about what you do with your life is better, because true wealth is about experience. A much-needed grab-you-by-the-shoulders-and-look-you-in-the-eye moment of real-talk, filled with entertaining stories and profane, ruthless humor, The Subtle Art of Not Giving a F**k is a refreshing slap for a generation to help them lead contented, grounded lives.",
    "image": "http://books.google.com/books/content?id=yng_CwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "averageRating": 4,
    "ratingsCount": 14,
    "categories": [
      "Self-Help"
    ],
    "pageCount": 224,
    "isbn10": "006245773X",
    "isbn13": "9780062457738",
    "googleBooks": {
      "id": "yng_CwAAQBAJ",
      "preview": "http://books.google.com/books?id=yng_CwAAQBAJ&printsec=frontcover&dq=intitle:The+subtle+art+if+bit+giving+a+fuck+by+mark+manson&hl=&cd=1&source=gbs_api",
      "info": "https://play.google.com/store/books/details?id=yng_CwAAQBAJ&source=gbs_api",
      "canonical": "https://play.google.com/store/books/details?id=yng_CwAAQBAJ"
    },
    "issueNumber": 5,
    "progressPercent": 0,
    "state": "completed",
    "startedAt": "2022-05-09T11:11:18.000Z",
    "completedAt": "2022-05-09T11:12:01.000Z",
    "timeToComplete": 43000,
    "timeToCompleteFormatted": "43 seconds"
  },
  {
    "title": "Team Topologies",
    "authors": [
      "Matthew Skelton",
      "Manuel Pais"
    ],
    "publisher": "It Revolution Press",
    "publishedDate": "2019-09-07",
    "description": "In Team Topologies IT consultants Matthew Skelton and Manuel Pais share secrets of successful team patterns and interactions for IT through four fundamental team topologies and three interaction modes.",
    "image": "http://books.google.com/books/content?id=oFdRuAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "language": "en",
    "categories": [
      "Business & Economics"
    ],
    "pageCount": 240,
    "isbn10": "1942788819",
    "isbn13": "9781942788812",
    "googleBooks": {
      "id": "oFdRuAEACAAJ",
      "preview": "http://books.google.com/books?id=oFdRuAEACAAJ&dq=intitle:Team+Topologies+by+Matthew+Skelton+and+Manuel+Pais&hl=&cd=1&source=gbs_api",
      "info": "http://books.google.com/books?id=oFdRuAEACAAJ&dq=intitle:Team+Topologies+by+Matthew+Skelton+and+Manuel+Pais&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/Team_Topologies.html?hl=&id=oFdRuAEACAAJ"
    },
    "issueNumber": 4,
    "progressPercent": 0,
    "state": "completed",
    "startedAt": "2022-05-09T11:07:08.000Z",
    "completedAt": "2022-05-09T11:10:01.000Z",
    "timeToComplete": 173000,
    "timeToCompleteFormatted": "2 minutes"
  },
  {
    "title": "Deep Work",
    "authors": [
      "Cal Newport"
    ],
    "publisher": "Piatkus Books",
    "publishedDate": "2016-01-15",
    "image": "http://books.google.com/books/content?id=UcYkjwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "language": "en",
    "averageRating": 4,
    "ratingsCount": 24,
    "pageCount": 304,
    "isbn10": "0349413681",
    "isbn13": "9780349413686",
    "googleBooks": {
      "id": "UcYkjwEACAAJ",
      "preview": "http://books.google.com/books?id=UcYkjwEACAAJ&dq=intitle:Deep+Work+by+Cal+Newport&hl=&cd=1&source=gbs_api",
      "info": "http://books.google.com/books?id=UcYkjwEACAAJ&dq=intitle:Deep+Work+by+Cal+Newport&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/Deep_Work.html?hl=&id=UcYkjwEACAAJ"
    },
    "issueNumber": 3,
    "progressPercent": 0,
    "state": "completed",
    "startedAt": "2022-05-09T11:06:33.000Z",
    "completedAt": "2022-05-09T11:10:09.000Z",
    "timeToComplete": 216000,
    "timeToCompleteFormatted": "3 minutes"
  },
  {
    "title": "The Manager's Path",
    "authors": [
      "Camille Fournier"
    ],
    "publisher": "\"O'Reilly Media, Inc.\"",
    "publishedDate": "2017-03-13",
    "description": "Managing people is difficult wherever you work. But in the tech industry, where management is also a technical discipline, the learning curve can be brutal—especially when there are few tools, texts, and frameworks to help you. In this practical guide, author Camille Fournier (tech lead turned CTO) takes you through each stage in the journey from engineer to technical manager. From mentoring interns to working with senior staff, you’ll get actionable advice for approaching various obstacles in your path. This book is ideal whether you’re a new manager, a mentor, or a more experienced leader looking for fresh advice. Pick up this book and learn how to become a better manager and leader in your organization. Begin by exploring what you expect from a manager Understand what it takes to be a good mentor, and a good tech lead Learn how to manage individual members while remaining focused on the entire team Understand how to manage yourself and avoid common pitfalls that challenge many leaders Manage multiple teams and learn how to manage managers Learn how to build and bootstrap a unifying culture in teams",
    "image": "http://books.google.com/books/content?id=FaNaDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "averageRating": 4.5,
    "ratingsCount": 5,
    "categories": [
      "Business & Economics"
    ],
    "pageCount": 244,
    "isbn10": "1491973846",
    "isbn13": "9781491973844",
    "googleBooks": {
      "id": "FaNaDgAAQBAJ",
      "preview": "http://books.google.com/books?id=FaNaDgAAQBAJ&pg=PT1&dq=intitle:The+Manager%27s+Path+by+Camille+Fournier&hl=&cd=7&source=gbs_api",
      "info": "https://play.google.com/store/books/details?id=FaNaDgAAQBAJ&source=gbs_api",
      "canonical": "https://play.google.com/store/books/details?id=FaNaDgAAQBAJ"
    },
    "issueNumber": 2,
    "progressPercent": 0,
    "state": "completed",
    "startedAt": "2022-05-09T11:06:15.000Z",
    "completedAt": "2022-05-09T11:08:45.000Z",
    "timeToComplete": 150000,
    "timeToCompleteFormatted": "2 minutes"
  },
  {
    "title": "Managing Humans",
    "authors": [
      "Michael Lopp"
    ],
    "publisher": "Apress",
    "publishedDate": "2012-11-30",
    "description": "The humor and insights in the 2nd Edition of Managing Humans are drawn from Michael Lopp's management experiences at Apple, Netscape, Symantec, and Borland, among others. This book is full of stories based on companies in the Silicon Valley where people have been known to yell at each other and occasionally throw chairs. It is a place full of dysfunctional bright people who are in an incredible hurry to find the next big thing so they can strike it rich and then do it all over again. Among these people are managers, a strange breed of people who, through a mystical organizational ritual, have been given power over the future and bank accounts of many others. Whether you're an aspiring manager, a current manager, or just wondering what the heck a manager does all day, there is a story in this book that will speak to you—and help you survive and prosper amongst the general craziness. Lopp's straight-from-the-hip style is unlike any other writer on management. He pulls no punches and tells stories he probably shouldn't. But they are massively instructive and cut to the heart of the matter whether it's dealing with your boss, handling a slacker, hiring top guns, or seeing a knotty project through to completion. This second editions expands on the management essentials. It will explain why we hate meetings, but must have them, it carefully documents the right way to have a 1-on-1, and it documents the perils of not listening to your team. Writing code is easy. Managing humans is not. You need a book to help you do it, and this is it.",
    "image": "http://books.google.com/books/content?id=o3ykfQxl7pMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "averageRating": 4.5,
    "ratingsCount": 2,
    "categories": [
      "Business & Economics"
    ],
    "pageCount": 292,
    "isbn10": "1430243155",
    "isbn13": "9781430243151",
    "googleBooks": {
      "id": "o3ykfQxl7pMC",
      "preview": "http://books.google.com/books?id=o3ykfQxl7pMC&printsec=frontcover&dq=intitle:Managing+Humans+by+Michael+Lopp&hl=&cd=1&source=gbs_api",
      "info": "https://play.google.com/store/books/details?id=o3ykfQxl7pMC&source=gbs_api",
      "canonical": "https://play.google.com/store/books/details?id=o3ykfQxl7pMC"
    },
    "issueNumber": 1,
    "progressPercent": 0,
    "state": "completed",
    "startedAt": "2022-05-09T10:53:30.000Z",
    "completedAt": "2022-08-07T02:56:12.000Z",
    "timeToComplete": 7747362000,
    "timeToCompleteFormatted": "2 months"
  }
]
